"""
Имеется строка 12361573928167047230472012.
Напишите программу, которая преобразует строку в текст один236один573928один670472304720один2.
Пр234и5ве89т
"""
a = "12361573928167047230472012"
print(a.replace("1", "one"))