"""
Напишите программу, которая выводит на экран прямоугольник 5 х 15, сформированный из звездочек. Пример вывода:

***************
*             *
*             *
*             *
***************
"""
print("*" * 15)
print("*", " " * 11, "*")
print("*", " " * 11, "*")
print("*", " " * 11, "*")
print("*" * 15)