"""
Поменяйте в словаре d = {1: '1', 2: '2', 3: '3', 4: '4'} ключи и значения местами.
Выведите итоговый словарь на экран.
"""
d = {1: 'a', 2: 'b', 3: 'c', 4: 'd'}
# print({k: v for v, k in d.items()})
print(dict(zip(list(d.values()), list(d.keys()))))
