"""
<<<<<<< HEAD
Напишите программу,
которая получает на вход две строки с перечислением интересов и хобби двух пользователей,
=======
Напишите программу, которая получает на вход две строки с перечислением интересов и хобби двух пользователей,
>>>>>>> 4f2f10f42747aa72c071cb03015c264c2ad42f6f
и вычисляет процент совпадения.

кино книги велосипед хоккей кулинария цветы кошки
кошки кино путешествия футбол кулинария автомобили дайвинг

Совпадение интересов: 27.27%
"""

<<<<<<< HEAD
hobby1 = "кино книги велосипед хоккей кулинария цветы кошки"
hobby2 = "кошки кино путешествия футбол кулинария автомобили дайвинг"
hobby_set1 = set(hobby1.split())
hobby_set2 = set(hobby2.split())

print(len(hobby_set1 & hobby_set2) / len(hobby_set1 | hobby_set2) * 100)
=======
>>>>>>> 4f2f10f42747aa72c071cb03015c264c2ad42f6f
