"""
<<<<<<< HEAD
Напишите программу, которая получает на вход три слова и определяет,
являются ли они анаграммами друг друга.
=======
Напишите программу, которая получает на вход три слова и определяет, являются ли они анаграммами друг друга.
>>>>>>> 4f2f10f42747aa72c071cb03015c264c2ad42f6f
кластер
стрелка
сталкер

>>> True
"""
<<<<<<< HEAD
from collections import Counter

str1 = "кластер"
str2 = "стрелка"
str3 = "сталкер"

counter = Counter(str1)
print(dict(counter))




# print("Ok" if set(str1) == set(str2) == set(str3) else "Not Ok")
=======
>>>>>>> 4f2f10f42747aa72c071cb03015c264c2ad42f6f
